mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xr/common/mb9bf36xr.h
#define bFM_SDIF_SPRVAL6_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0DA8UL))
#define bFM4_SDIF_SPRVAL6_CGSELVAL                *((volatile  uint8_t *)(0x42DC0DA8UL))

#define bFM_SDIF_SPRVAL7_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0DE8UL))
#define bFM4_SDIF_SPRVAL7_CGSELVAL                *((volatile  uint8_t *)(0x42DC0DE8UL))

#define bFM_SDIF_SPWRCTL_SDBUSPWR                 *((volatile  uint8_t *)(0x42DC0520UL))
#define bFM4_SDIF_SPWRCTL_SDBUSPWR                *((volatile  uint8_t *)(0x42DC0520UL))

#define bFM_SDIF_SPWSWCL_ATPWRSWEN                *((volatile  uint8_t *)(0x42DC2080UL))
#define bFM4_SDIF_SPWSWCL_ATPWRSWEN               *((volatile  uint8_t *)(0x42DC2080UL))
#define bFM_SDIF_SPWSWCL_IOREGSEL                 *((volatile  uint8_t *)(0x42DC2084UL))
#define bFM4_SDIF_SPWSWCL_IOREGSEL                *((volatile  uint8_t *)(0x42DC2084UL))

#define bFM_SDIF_SSRST_SWRSTALL                   *((volatile  uint8_t *)(0x42DC05E0UL))
#define bFM4_SDIF_SSRST_SWRSTALL                  *((volatile  uint8_t *)(0x42DC05E0UL))
#define bFM_SDIF_SSRST_SWRSTCMDLN                 *((volatile  uint8_t *)(0x42DC05E4UL))
#define bFM4_SDIF_SSRST_SWRSTCMDLN                *((volatile  uint8_t *)(0x42DC05E4UL))
#define bFM_SDIF_SSRST_SWRSTDATLN                 *((volatile  uint8_t *)(0x42DC05E8UL))
#define bFM4_SDIF_SSRST_SWRSTDATLN                *((volatile  uint8_t *)(0x42DC05E8UL))

#define bFM_SDIF_STRSFMD_DMAEN                    *((volatile  uint8_t *)(0x42DC0180UL))
#define bFM4_SDIF_STRSFMD_DMAEN                   *((volatile  uint8_t *)(0x42DC0180UL))
#define bFM_SDIF_STRSFMD_BLCKCNTEN                *((volatile  uint8_t *)(0x42DC0184UL))
#define bFM4_SDIF_STRSFMD_BLCKCNTEN               *((volatile  uint8_t *)(0x42DC0184UL))
#define bFM_SDIF_STRSFMD_DTTRSFDIR                *((volatile  uint8_t *)(0x42DC0190UL))
#define bFM4_SDIF_STRSFMD_DTTRSFDIR               *((volatile  uint8_t *)(0x42DC0190UL))
#define bFM_SDIF_STRSFMD_BLCKCNTSEL               *((volatile  uint8_t *)(0x42DC0194UL))
#define bFM4_SDIF_STRSFMD_BLCKCNTSEL              *((volatile  uint8_t *)(0x42DC0194UL))

#define bFM_SDIF_STUNSETH_CMDCFCHKDS              *((volatile  uint8_t *)(0x42DC2140UL))
#define bFM4_SDIF_STUNSETH_CMDCFCHKDS             *((volatile  uint8_t *)(0x42DC2140UL))

#define bFM_SDIF_STUNSETL_TNPHSELEN               *((volatile  uint8_t *)(0x42DC2120UL))
#define bFM4_SDIF_STUNSETL_TNPHSELEN              *((volatile  uint8_t *)(0x42DC2120UL))
#define bFM_SDIF_STUNSETL_TNERRBDSEL              *((volatile  uint8_t *)(0x42DC2124UL))
#define bFM4_SDIF_STUNSETL_TNERRBDSEL             *((volatile  uint8_t *)(0x42DC2124UL))
#define bFM_SDIF_STUNSETL_RETNTAPSEL              *((volatile  uint8_t *)(0x42DC2128UL))
#define bFM4_SDIF_STUNSETL_RETNTAPSEL             *((volatile  uint8_t *)(0x42DC2128UL))

#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN0             *((volatile  uint8_t *)(0x42DC0560UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN0            *((volatile  uint8_t *)(0x42DC0560UL))
#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN1             *((volatile  uint8_t *)(0x42DC0564UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN1            *((volatile  uint8_t *)(0x42DC0564UL))
#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN2             *((volatile  uint8_t *)(0x42DC0568UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN2            *((volatile  uint8_t *)(0x42DC0568UL))


/*******************************************************************************
* SWWDT Registers SWWDT
*   Bitband Section
*******************************************************************************/
#define bFM_SWWDT_WDOGCONTROL_INTEN               *((volatile  uint32_t*)(0x42240100UL))
#define bFM4_SWWDT_WDOGCONTROL_INTEN              *((volatile  uint32_t*)(0x42240100UL))
#define bFM_SWWDT_WDOGCONTROL_RESEN               *((volatile  uint32_t*)(0x42240104UL))
#define bFM4_SWWDT_WDOGCONTROL_RESEN              *((volatile  uint32_t*)(0x42240104UL))
#define bFM_SWWDT_WDOGCONTROL_SPM                 *((volatile  uint32_t*)(0x42240110UL))
#define bFM4_SWWDT_WDOGCONTROL_SPM                *((volatile  uint32_t*)(0x42240110UL))

#define bFM_SWWDT_WDOGRIS_RIS                     *((volatile  uint32_t*)(0x42240200UL))
#define bFM4_SWWDT_WDOGRIS_RIS                    *((volatile  uint32_t*)(0x42240200UL))

#define bFM_SWWDT_WDOGSPMC_TGR                    *((volatile  uint32_t*)(0x42240300UL))
#define bFM4_SWWDT_WDOGSPMC_TGR                   *((volatile  uint32_t*)(0x42240300UL))


/*******************************************************************************
* UNIQUE_ID Registers UNIQUE_ID
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* USB Registers USB0
*   Bitband Section
*******************************************************************************/
#define bFM_USB0_EP0C_STAL                        *((volatile  uint16_t*)(0x428424A4UL))
#define bFM4_USB0_EP0C_STAL                       *((volatile  uint16_t*)(0x428424A4UL))

#define bFM_USB0_EP0IS_DRQI                       *((volatile  uint16_t*)(0x428428A8UL))
#define bFM4_USB0_EP0IS_DRQI                      *((volatile  uint16_t*)(0x428428A8UL))
#define bFM_USB0_EP0IS_DRQIIE                     *((volatile  uint16_t*)(0x428428B8UL))
#define bFM4_USB0_EP0IS_DRQIIE                    *((volatile  uint16_t*)(0x428428B8UL))
#define bFM_USB0_EP0IS_BFINI                      *((volatile  uint16_t*)(0x428428BCUL))
#define bFM4_USB0_EP0IS_BFINI                     *((volatile  uint16_t*)(0x428428BCUL))

#define bFM_USB0_EP0OS_SPK                        *((volatile  uint16_t*)(0x42842924UL))
#define bFM4_USB0_EP0OS_SPK                       *((volatile  uint16_t*)(0x42842924UL))
#define bFM_USB0_EP0OS_DRQO                       *((volatile  uint16_t*)(0x42842928UL))
#define bFM4_USB0_EP0OS_DRQO                      *((volatile  uint16_t*)(0x42842928UL))
#define bFM_USB0_EP0OS_SPKIE                      *((volatile  uint16_t*)(0x42842934UL))
#define bFM4_USB0_EP0OS_SPKIE                     *((volatile  uint16_t*)(0x42842934UL))
#define bFM_USB0_EP0OS_DRQOIE                     *((volatile  uint16_t*)(0x42842938UL))
#define bFM4_USB0_EP0OS_DRQOIE                    *((volatile  uint16_t*)(0x42842938UL))
#define bFM_USB0_EP0OS_BFINI                      *((volatile  uint16_t*)(0x4284293CUL))
#define bFM4_USB0_EP0OS_BFINI                     *((volatile  uint16_t*)(0x4284293CUL))

